In [3]:
import pandas as pd
data = {
    '2021' : [1116,12259,16699,65119],
    '2020' : [628,11075,15695,56013],
    '2019' : [678,12700,15148,55443],
    '2018' : [712,13597,16052,56024],
    '농지면적순위' : [4,3,2,1]
}
columns = ['농지면적순위','2021','2020','2019','2018']
index = ['서울','부산','대구','인천']
df = pd.DataFrame(data, index=index, columns=columns)
df

    농지면적순위   2021   2020   2019   2018
서울       4   1116    628    678    712
부산       3  12259  11075  12700  13597
대구       2  16699  15695  15148  16052
인천       1  65119  56013  55443  56024

In [4]:
df.columns

Index(['농지면적순위', '2021', '2020', '2019', '2018'], dtype='object')

In [5]:
df.index

Index(['서울', '부산', '대구', '인천'], dtype='object')

In [6]:
df.values

array([[    4,  1116,   628,   678,   712],
       [    3, 12259, 11075, 12700, 13597],
       [    2, 16699, 15695, 15148, 16052],
       [    1, 65119, 56013, 55443, 56024]], dtype=int64)

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 서울 to 인천
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   농지면적순위  4 non-null      int64
 1   2021    4 non-null      int64
 2   2020    4 non-null      int64
 3   2019    4 non-null      int64
 4   2018    4 non-null      int64
dtypes: int64(5)
memory usage: 192.0+ bytes

In [8]:
df.index.name = '지역'
df

    농지면적순위   2021   2020   2019   2018
지역
서울       4   1116    628    678    712
부산       3  12259  11075  12700  13597
대구       2  16699  15695  15148  16052
인천       1  65119  56013  55443  56024

In [11]:
df.columns.name = '특성'
df

특성  농지면적순위   2021   2020   2019   2018
지역
서울       4   1116    628    678    712
부산       3  12259  11075  12700  13597
대구       2  16699  15695  15148  16052
인천       1  65119  56013  55443  56024

In [15]:
pd.Series([1,2,3,4,None])

0    1.0
1    2.0
2    3.0
3    4.0
4    NaN
dtype: float64

In [39]:
df['2018-2021 변화율'] = ((df['2021']-df['2018'])/df['2018'] * 100)
df

특성   2018   2019   2020   2021  농지면적순위  2018-2021 변화율
지역
서울    712    678    628   1116       4      56.741573
부산  13597  12700  11075  12259       3      -9.840406
대구  16052  15148  15695  16699       2       4.030650
인천  56024  55443  56013  65119       1      16.234114

In [41]:
df['2018-2021 변화율'].astype(int)
df

특성   2018   2019   2020   2021  농지면적순위  2018-2021 변화율
지역
서울    712    678    628   1116       4      56.741573
부산  13597  12700  11075  12259       3      -9.840406
대구  16052  15148  15695  16699       2       4.030650
인천  56024  55443  56013  65119       1      16.234114

In [43]:
df = df[['2018','2019','2020','2021','농지면적순위','2018-2021 변화율']]
df.T.astype(int)

지역               서울     부산     대구     인천
특성
2018            712  13597  16052  56024
2019            678  12700  15148  55443
2020            628  11075  15695  56013
2021           1116  12259  16699  65119
농지면적순위            4      3      2      1
2018-2021 변화율    56     -9      4     16

In [28]:
df[['2018','2021']]

특성   2018   2021
지역
서울    712   1116
부산  13597  12259
대구  16052  16699
인천  56024  65119

In [29]:
df['2018']

지역
서울      712
부산    13597
대구    16052
인천    56024
Name: 2018, dtype: int64

In [30]:
# 시리즈 먼저 뽑고 index로 접근하는 과정(하나의 데이터 타입만 갖고오기 때문에 데이터 타입에 유의해야 함)
df['2018']['서울']

712

In [31]:
temp = pd.Series(['a','b','c','d','e'])
temp

0    a
1    b
2    c
3    d
4    e
dtype: object

In [33]:
temp[0]

'a'

In [38]:
print(df['2021']['서울'])
print(df['2021'][0])

1116
1116

In [46]:
df.sort_values(by='2018-2021 변화율')
df

특성   2018   2019   2020   2021  농지면적순위  2018-2021 변화율
지역
서울    712    678    628   1116       4      56.741573
부산  13597  12700  11075  12259       3      -9.840406
대구  16052  15148  15695  16699       2       4.030650
인천  56024  55443  56013  65119       1      16.234114

In [48]:
temp_list = [1,2,3,4]
temp_list[:2]

[1, 2]

In [49]:
df

특성   2018   2019   2020   2021  농지면적순위  2018-2021 변화율
지역
서울    712    678    628   1116       4      56.741573
부산  13597  12700  11075  12259       3      -9.840406
대구  16052  15148  15695  16699       2       4.030650
인천  56024  55443  56013  65119       1      16.234114

In [51]:
df[:1]

특성  2018  2019  2020  2021  농지면적순위  2018-2021 변화율
지역
서울   712   678   628  1116       4      56.741573

In [52]:
df['서울':'부산']

특성   2018   2019   2020   2021  농지면적순위  2018-2021 변화율
지역
서울    712    678    628   1116       4      56.741573
부산  13597  12700  11075  12259       3      -9.840406

In [55]:
# loc, iloc
# 인덱스 접근의 경우 콜론(:)으로 접근 외에도 loc 또는 iloc 메서드를 이용하여 접근 할 수 있다.
df.loc[['부산','대구']]

특성   2018   2019   2020   2021  농지면적순위  2018-2021 변화율
지역
부산  13597  12700  11075  12259       3      -9.840406
대구  16052  15148  15695  16699       2       4.030650

In [56]:
df.iloc[0]

특성
2018              712.000000
2019              678.000000
2020              628.000000
2021             1116.000000
농지면적순위              4.000000
2018-2021 변화율      56.741573
Name: 서울, dtype: float64

In [57]:
df.iloc[0,0]

712

In [58]:
df['2018']['서울']

712

In [59]:
df.iloc[0][0]

712.0

# 실습
1. 인덱스는 학생 5명(철수, 영희, 길동, 슬기)
2. 컬럼은 4개(국어, 영어, 수학, 과학)
a. 순서대로 국어 영어 수학 과학
b. 철수 : 80, 90, 70, 30
c. 영희 : 90, 50, 100, 50
d. 길동 : 70, 60, 50, 80
e. 슬기 : 50, 100, 70, 80
3. 해당 데이터로 데이터 프레임 생성
4. 각 학생들의 과목 평균 column 추가
5. 과목별 평균 추가

In [86]:
sdata = {
    '과학' : [30,50,80,80],
    '수학' : [70,100,50,70],
    '영어' : [90,50,60,100],
    '국어' : [80,90,70,50],
}
columns = ['국어','영어','수학','과학']
index = ['철수','영희','길동','슬기']
df = pd.DataFrame(sdata, index=index, columns=columns)
df

    국어   영어   수학  과학
철수  80   90   70  30
영희  90   50  100  50
길동  70   60   50  80
슬기  50  100   70  80

In [87]:
df['학생평균'] = df.mean(axis=1)

In [88]:
df.loc['과목평균'] = df.mean()

In [89]:
df

        국어     영어     수학    과학  학생평균
철수    80.0   90.0   70.0  30.0  67.5
영희    90.0   50.0  100.0  50.0  72.5
길동    70.0   60.0   50.0  80.0  65.0
슬기    50.0  100.0   70.0  80.0  75.0
과목평균  72.5   75.0   72.5  60.0  70.0

In [84]:
# 학생평균 column 접근
# df['학생평균'] = (df['국어'] + df['영어'] +df['수학']+ df['과학']) / 4

In [90]:
# df['과목평균'] = (df.loc['국어'] + df.loc['영어'] +df.loc['수학']+ df.loc['과학']) / 4

In [ ]:
# ~~ csv 파일 불러오기
# df = pd.read_csv()